
Решить задачу, используя стек или очередь

Составить программу, которая содержит динамическую информацию о такси.

Сведения о каждом такси включают:
· номер такси;
· марка автомобиля;
· фамилию и инициалы водителя;
· признак того, где находится такси — на вызове или в свободное.

Программа должна обеспечивать:
· начальное формирование данных обо всех такси в виде стека или очереди;
· вывод всех такси;
· добавление такси в начало списка;
· добавление такси перед определенным такси;
· удаление выбранного такси.
· при выезде каждого такси вводится номер такси, и программа
устанавливает значение признака «такси на вызове»;
· при освобождении такси вводится номер такси, и программа устанавливает
значение признака «такси свободное»;
· по запросу выдаются сведения о свободных такси, или о такси,
находящихся на выезде.

  string code_menu = "print_all" | "add" | "add_positon" | "pop_item" | "print_on" | | "print_off" | "back" | "exit"


  std::cout << "┌──────────────┐\n"
            << "|" << "Taxi #772     " << "|\n"
               "|" << "              " << "|\n"
               "|" << "M: Audi       " << "|\n"
               "|" << "D: Anton A.A. " << "|\n"
               "|" << "ON: [-]       " << "|\n"
               "└──────────────┘"
            << std::endl;
