#include <iostream>

int main()
{
    return 0;
}

/* Первая программа демонстрирует использование контейнерных классов для хранения встроенных типов данных. */

// 1 контейнер - queue
// 2 контейнер - vector
// Встроенный тип данных - char
/*
В программе № 1 выполнить следующее:
1. Создать объект-контейнер "queue<char>" и заполнить его данными.
2. Просмотреть контейнер.
3. Изменить контейнер, удалив из него одни элементы и заменив другие.
4. Просмотреть контейнер, используя для доступа к его элементам итераторы.
5. Создать второй контейнер этого же класса и заполнить его данными того же типа, что и первый контейнер.
6. Изменить первый контейнер, удалив из него n элементов после заданного и добавив затем в него все элементы из второго контейнера.
7. Просмотреть первый и второй контейнеры.
*/
